<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"4947bd7de1bdacaa5ca1366a7603cf542e9c4cc09dd0f2cf5430a399b8b1a6bb","plan_job_ref":"Job Terraform Plan #314 at https://github.com/cal-itp/data-infra/actions/runs/15918612061","plan_out_hash":"c376c612c56ce3d585b41f4c2d421a52fac641494dbf90d750d49b3505c8fbfb","plan_hash":"b3eb2b31c04a3fd50bdefcc58b559e761e66c149662740f67e61d54cd23714c4","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp--composer-partial_parse will be created
+   resource "google_storage_bucket_object" "calitp--composer-partial_parse" {
+       bucket         = "us-west2-calitp-airflow2-pr-f6bb9855-bucket"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/target/partial_parse.msgpack"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-run_results will be destroyed
  # (because google_storage_bucket_object.calitp-composer-run_results is not in configuration)
-   resource "google_storage_bucket_object" "calitp-composer-run_results" {
-       bucket              = "us-west2-calitp-airflow2-pr-f6bb9855-bucket" -> null
-       content             = (sensitive value) -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "Kp1Prw==" -> null
-       detect_md5hash      = "WW65bIh/OMqQuRoIfhJbRw==" -> null
-       event_based_hold    = false -> null
-       generation          = 1750998724054540 -> null
-       id                  = "us-west2-calitp-airflow2-pr-f6bb9855-bucket-data/warehouse/target/run_results.json" -> null
-       md5hash             = "WW65bIh/OMqQuRoIfhJbRw==" -> null
-       md5hexhash          = "596eb96c887f38ca90b91a087e125b47" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/us-west2-calitp-airflow2-pr-f6bb9855-bucket/o/data%2Fwarehouse%2Ftarget%2Frun_results.json?generation=1750998724054540&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/target/run_results.json" -> null
-       output_name         = "data/warehouse/target/run_results.json" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/us-west2-calitp-airflow2-pr-f6bb9855-bucket/o/data%2Fwarehouse%2Ftarget%2Frun_results.json" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (5 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #314](https://github.com/cal-itp/data-infra/actions/runs/15918612061)